export const defaultLocation = {
  lat: 54.33599,
  lng: 48.38209,
};

export const locations = [
  {
    id: 1,
    location: {
      name: "Санкт-Петербург",
      lat: 59.92609,
      lng: 30.29595,
      points: [
        {
          id: 1,
          address: "Театральная пл., 1",
          lat: 59.925672057256016,
          lng: 30.29601349107098,
        },
        {
          id: 2,
          address: "Дворцовая пл., 2",
          lat: 59.941693107848174,
          lng: 30.315313418480486,
        },
        {
          id: 3,
          address: "пл. Растрелли, 1",
          lat: 59.951149771192625,
          lng: 30.394449308443853,
        },
        {
          id: 4,
          address: "Невский пр., 85",
          lat: 59.932075969727634,
          lng: 30.362609511329634,
        },
      ],
    },
  },
  {
    id: 2,
    location: {
      name: "Ульяновск",
      lat: 54.33599,
      lng: 48.38209,
      points: [
        {
          id: 1,
          address: "пр. Нариманова,  д.1",
          lat: 54.33599,
          lng: 48.38209,
        },
        {
          id: 2,
          address: "ул. Минаева, 11",
          lat: 54.3089282855407,
          lng: 48.388315310347274,
        },
        {
          id: 3,
          address: "ул. Радищева, 39",
          lat: 54.32840280512737,
          lng: 48.40136157419197,
        },
        {
          id: 4,
          address: "ул. Пушкарёва, 11",
          lat: 54.31458635821251,
          lng: 48.35269557558976,
        },
      ],
    },
  },
  {
    id: 3,
    location: {
      name: "Казань",
      lat: 55.786126269470294,
      lng: 49.12959898637359,
      points: [
        {
          id: 1,
          address: "ул. Ф.Амирхана, д.10",
          lat: 55.84386418976917,
          lng: 49.13708859760795,
        },
        {
          id: 2,
          address: "ул. Мусина, 1",
          lat: 55.81805386353286,
          lng: 49.12009356897661,
        },
        {
          id: 3,
          address: "ул. Петербургская, 1",
          lat: 55.78780715246299,
          lng: 49.12429927305641,
        },
        {
          id: 4,
          address: "пр-т. Хусаина Ямашева",
          lat: 55.83126434773991,
          lng: 49.11571620518475,
        },
      ],
    },
  },
];
